"""ข้อมูลปีพุทธกาล 2554"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1 : [[4, 2, 3], [3, 2, 0], [18.78845, 99.02664], "โรงพยาบาลกรุงเทพ"]\
           , 2 : [[0, 0, 0], [2, 1, 1], [13.72831, 100.53215], "โรงพยาบาลกรุงเทพคริสเตียน"]\
           , 3: [[40, 20, 9], [15, 6, 0], [13.71075, 100.39911], "โรงพยาบาลเกษมราษฏร์บางเเค"]\
           , 4 : [[17, 6, 5], [5, 0, 0], [13.73171, 100.53647], "โรงพยาบาลจุฬาลงกรณ์"]\
           , 5 : [[3, 1, 0], [3, 2, 0], [13.69436, 100.49473], "โรงพยาบาลเจริญกรุงประชารักษ์"]\
           , 6 : [[19, 0, 2], [5, 2, 1], [13.7311, 100.5080], "โรงพยาบาลตากสิน"]\
           , 7 : [[19, 8, 9], [4, 2, 2], [13.74305, 100.53837], "โรงพยาบาลตำรวจ"]\
           , 8 : [[15, 11, 6], [3, 1, 0], [13.66053, 100.43457], "โรงพยาบาลนครธน"]\
           , 9 : [[5, 3, 2], [1, 0, 0], [13.8169, 100.6880], "โรงพยาบาลนพรัตนราชธานี"]\
           , 10 : [[50, 40, ], [24, 16, 22], [13.8116, 100.7216], "โรงพยาบาลนวมินทร์"]\
           , 11 : [[5, 2, 3], [5, 4, 1], [13.7254, 100.4651], "โรงพยาบาลบางไผ่"]\
           , 12 : [[10, 4, 7], [4, 1, 4], [13.8072, 100.5232], "โรงพยาบาลบางโพ"]\
           , 13 : [[8, 7, 2], [2, 2, 2], [13.65167, 100.42214], "โรงพยาบาลพระราม 2"]\
           , 14 : [[4, 3, 2], [3, 3, 0], [13.7428, 100.5945], "โรงพยาบาลเพชรเวช"]\
           , 15 : [[10, 3, 5], [6, 3, 5], [13.7579, 100.5187], "โรงพยาบาลมิชชั่น"]\
           , 16 : [[20, 12, 10], [11, 4, 1], [13.76360, 100.53633], "โรงพยาบาลราชวิถี"]\
           , 17 : [[3, 0, 0], [5, 1, 1], [13.77811, 100.62432], "โรงพยาบาลลาดพร้าว"]\
           , 18 : [[1, 0, 1], [2, 1, 0], [13.78325, 100.53402], "โรงพยาบาลวิชัยยุทธ"]\
           , 19 : [[8, 0, 1], [3, 1, 0], [13.84582, 100.56227], "โรงพยาบาลวิภาวดี"]\
           , 20 : [[1, 0, 1], [2, 0, 0], [13.77176, 100.63703], "โรงพยาบาลเวชธานี"]\
           , 21 : [[15, 7, 3], [10, 7, 2], [13.7079, 100.3608], "โรงพยาบาลศรีวิชัย 2"]\
           , 22 : [[8, 4, 2], [11, 5, 0], [13.8255, 100.6575], "โรงพยาบาลศรีสยาม"]\
           , 23 : [[13, 7, 3], [3, 3, 0], [13.8562, 100.8589], "โรงพยาบาลหนองจอก"]\
           , 24 : [[8, 8, 6], [2, 2, 0], [13.6563, 100.3453], "โรงพยาบาลหลวงพ่อทวีศักดิ์"]\
           , 25 : [[8, 0, 1], [7, 3, 0], [13.7506, 100.5156], "โรงพยาบาลหัวเฉียว"]\
           , 26 : [[10, 5, 3], [7, 7, 0], [13.60832, 100.55148], "โรงพยาบาลกรุงเทพพระประแดง"]\
           , 27 : [[3, 3, 2], [2, 1, 0], [13.6098, 100.5400], "โรงพยาบาลบางจาก"]\
           , 28 : [[23, 20, 6], [4, 3, 1], [13.5695, 100.8362], "โรงพยาบาลบางบ่อ"]\
           , 29 : [[17, 6, 3], [8, 6, 0], [13.6034, 100.7062], "โรงพยาบาลบางพลี"]\
           , 30 : [[20, 16, 10], [13, 8, 3], [13.5844, 100.5970], "โรงพยาบาลสมุทรปราการ"]}

def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_54():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_54.html')
