"""ข้อมูลปีพุทธกาล 2558"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1: [[9, 8, 2], [6, 6, 0], [8.83483, 99.16015], 'โรงพยาบาลเคียนซา']\
, 2: [[0, 0, 0], [0, 0, 0], [12.9422, 100.8869], 'โรงพยาบาลพัทยาเมโมเรียล']\
, 3: [[4, 2, 1], [2, 1, 0], [8.4980253, 99.9524173], 'โรงพยาบาลค่ายวชิราวุธ']\
, 4: [[18, 18, 3], [10, 10, 0], [14.7388, 103.6552], 'โรงพยาบาลลำดวน']\
, 5: [[20, 14, 2], [24, 15, 1], [13.5568, 100.2718], 'โรงพยาบาลมหาชัย']\
, 6: [[50, 31, 21], [27, 16, 5], [14.6319, 103.4111], 'โรงพยาบาลปราสาท']\
, 7: [[12, 9, 6], [2, 2, 0], [15.6976, 104.6419], 'โรงพยาบาลลืออำนาจ']\
, 8: [[22, 18, 5], [10, 6, 0], [8.1746, 99.8620], 'โรงพยาบาลร่อนพิบูลย์']\
, 9: [[28, 25, 20], [12, 8, 1], [16.6499, 103.2966], 'โรงพยาบาลหนองกุงศรี']\
, 10: [[20, 17, 6], [10, 8, 1], [13.7917, 100.1957], 'โรงพยาบาลนครชัยศรี']\
, 11: [[2, 2, 1], [4, 2, 2], [13.63370, 100.71013], 'โรงพยาบาลจุฬารัตน์']\
, 12: [[0, 0, 0], [0, 0, 0], [13.5762, 100.2715], 'โรงพยาบาลศรีวิชัย5']\
, 13: [[18, 14, 10], [7, 4, 0], [7.2595, 100.1767], 'โรงพยาบาลป่าบอน']\
, 14: [[7, 7, 4], [2, 0, 0], [18.8948, 100.2939], 'โรงพยาบาลเชียงม่วน']\
, 15: [[15, 9, 5], [7, 3, 1], [18.0896, 99.8439], 'โรงพยาบาลลอง']\
, 16: [[10, 7, 2], [11, 7, 1], [14.9886, 100.3346], 'โรงพยาบาลอินทร์บุรี']\
, 17: [[9, 9, 2], [6, 5, 1], [7.8401668, 99.9401359] 'โรงพยาบาลป่าพะยอม']\
, 18: [[16, 16, 13], [8, 6, 1], [17.0348, 100.2013] 'โรงพยาบาลพรหมพิราม']\
, 19: [[25, 17, 14], [10, 9, 1], [13.8168, 102.0726] 'โรงพยาบาลสมเด็จพระยุพราชสระแก้ว']\
, 20: [[5, 5, 4], [4, 4, 0], [7.7169, 99.8787] 'โรงพยาบาลศรีบรรพต']\
, 21: [[8, 5, 3], [9, 7, 0], [13.2821, 101.4200] 'โรงพยาบาลบ่อทอง']\
, 22: [[17, 16, 10], [6, 5, 0], [15.6327, 103.3428] 'โรงพยาบาลปทุมรัตต์']\
, 23: [[2, 2, 0], [2, 2, 0], [8.5010, 98.6290] 'โรงพยาบาลทับปุด']\
, 24: [[7, 5, 1], [5, 3, 0], [8.4168462, 99.9630105] 'โรงพยาบาลเทศบาลนครศรีธรรมราช']\
, 25: [[17, 10, 2], [13, 7, 1], [18.2824, 99.4854] 'โรงพยาบาลเขลางค์นคร']\
, 26: [[18, 13, 11], [3, 3, 0], [15.7815102, 99.5189613] 'โรงพยาบาลแม่วงก์']\
, 27: [[26, 19, 16], [9, 5, 1], [15.7575383, 99.8135516] 'โรงพยาบาลลาดยาว']\
, 28: [[8, 6, 3], [3, 3, 0], [14.4465, 100.3731] 'โรงพยาบาลผักไห่']\
, 29: [[12, 7, 6], [5, 2, 0], [13.650496, 100.5918503] 'โรงพยาบาลสำโรงการแพทย์']\
, 30: [[17, 15, 3], [6, 6, 0], [9.5974, 99.1659] 'โรงพยาบาลท่าชนะ']\
, 31: [[1, 0, 0], [0, 0, 0], [12.4098953, 99.9215014] 'โรงพยาบาลค่ายธนะรัตน์']\
, 32: [[4, 4, 3], [6, 4, 0], [16.8000671, 104.5280083] 'โรงพยาบาลดงหลวง']\
, 33: [[16, 11, 9], [15, 11, 0], [17.6368, 99.2404] 'โรงพยาบาลเถิน']\
, 34: [[45, 36, 17], [31, 23, 3], [13.4064, 99.9980] 'โรงพยาบาลสมเด็จพระพุทธเลิศหล้า']\
, 35: [[21, 19, 10], [7, 6, 0], [16.1589271, 100.6016093] 'โรงพยาบาลทับคล้อ']\
, 36: [[12, 8, 8], [10, 6, 0], [15.2988111, 101.9816919] 'โรงพยาบาลพระทองคำ']\
, 37: [[4, 3, 0], [4, 0, 0], [8.4488, 98.5263] 'โรงพยาบาลพังงา']\
, 38: [[1, 1, 1], [1, 1, 0], [16.0010937, 100.5872895] 'โรงพยาบาลดงเจริญ']\
, 39: [[11, 10, 11], [5, 4, 0], [18.1573101, 99.5374373] 'โรงพยาบาลแม่ทะ']\
, 40: [[5, 4, 2], [11, 6, 3], [13.648878, 100.5676927] 'โรงพยาบาลชัยปราการ']\
, 41: [[14, 9, 3], [9, 4, 0], [] 'โรงพยาบาลสิริเวช']\
, 42: [[11, 9, 8], [8, 7, 0], [] 'โรงพยาบาลคีรีมาศ']\
, 43: [[30, 29, 14], [10, 10, 3], [] 'โรงพยาบาลสีชมพู']\
, 44: [[97, 84, 21], [48, 39, 1], [] 'โรงพยาบาลตรัง']\
, 45: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลสงขลานครินทร์']\
, 46: [[8, 8, 4], [5, 5, 0], [] 'โรงพยาบาลนามน']\
, 47: [[28, 23, 13], [13, 11, 0], [] 'โรงพยาบาลกำแพงแสน']\
, 48: [[23, 20, 3], [6, 6, 0], [] 'โรงพยาบาลละแม']\
, 49: [[8, 6, 1], [5, 5, 0], [] 'โรงพยาบาลโพนนาแก้ว']\
, 50: [[5, 4, 1], [6, 2, 0], [] 'โรงพยาบาลนครินทร์']\
, 51: [[10, 5, 2], [2, 1, 0], [] 'โรงพยาบาลศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดา']\
, 52: [[78, 60, 37], [35, 25, 2], [] 'โรงพยาบาลปากช่องนานา']\
, 53: [[49, 46, 24], [31, 29, 1], [] 'โรงพยาบาลราชบุรี']\
, 54: [[23, 22, 18], [3, 3, 0], [] 'โรงพยาบาลภูเวียง']\
, 55: [[30, 25, 17], [15, 13, 2], [] 'โรงพยาบาลพิจิตร']\
, 56: [[48, 43, 13], [37, 30, 3], [] 'โรงพยาบาลกระบี่']\
, 57: [[34, 33, 8], [30, 21, 1], [] 'โรงพยาบาลท่ายาง']\
, 58: [[11, 8, 4], [4, 2, 0], [] 'โรงพยาบาลรวมชัยประชารักษ์']\
, 59: [[0, 0, 0], [1, 1, 0], [] 'โรงพยาบาลร้านหมอสวนิตย์']\
, 60: [[67, 56, 19], [42, 35, 2], [] 'โรงพยาบาลหัวหิน']\
, 61: [[5, 3, 1], [2, 2, 0], [] 'โรงพยาบาลคุระบุรี']\
, 62: [[41, 33, 13], [26, 18, 1], [] 'โรงพยาบาลพหลพลพยุหเสนา']\
, 63: [[19, 15, 5], [6, 2, 0], [] 'โรงพยาบาลหนองฉาง']\
, 64: [[5, 4, 3], [6, 6, 0], [] 'โรงพยาบาลสำทะเมนชัย']\
, 65: [[24, 17, 7], [15, 13, 1], [] 'โรงพยาบาลบ้านแพ้ว']\
, 66: [[60, 46, 24], [38, 27, 2], [] 'โรงพยาบาลสวรรค์ประชารักษ์']\
, 67: [[11, 11, 4], [1, 1, 0], [] 'โรงพยาบาลภูผาม่าน']\
, 68: [[6, 3, 4], [1, 1, 1], [] 'โรงพยาบาลเขมราฐ']\
, 69: [[2, 2, 1], [0, 0, 0], [] 'โรงพยาบาลกาบัง']\
, 70: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลธีรวัฒน์']\
, 71: [[12, 7, 2], [11, 7, 0], [] 'โรงพยาบาลกรุงเทพปากช่อง']\
, 72: [[9, 9, 5], [8, 6, 0], [] 'โรงพยาบาลท่าปลา']\
, 73: [[10, 7, 10], [0, 0, 0], [] 'โรงพยาบาลไทยเจริญ']\
, 74: [[23, 21, 15], [9, 8, 5], [] 'โรงพยาบาลวังโป่ง']\
, 75: [[12, 11, 5], [2, 2, 1], [] 'โรงพยาบาลแม่วาง']\
, 76: [[38, 24, 19], [12, 4, 1], [] 'โรงพยาบาลบรรพตพิสัย']\
, 77: [[33, 19, 12], [22, 14, 4], [] 'โรงพยาบาลระนอง']\
, 78: [[5, 4, 2], [1, 1, 0], [] 'โรงพยาบาลวัดเพลง']\
, 79: [[3, 3, 0], [4, 4, 0], [] 'โรงพยาบาลเจาะไอร้อง']\
, 80: [[1, 0, 1], [0, 0, 0], [] 'โรงพยาบาลนาหมื่น']\
, 81: [[50, 44, 18], [37, 34, 0], [] 'โรงพยาบาลหนองบัวลำภู']\
, 82: [[4, 4, 2], [6, 6, 1], [] 'โรงพยาบาลไทรงาม']\
, 83: [[30, 23, 16], [24, 20, 4], [] 'โรงพยาบาลชุมแพ']\
, 84: [[13, 11, 3], [15, 12, 1], [] 'โรงพยาบาลพระแสง']\
, 85: [[48, 39, 20], [16, 12, 1], [] 'โรงพยาบาลศีขรภูมิ']\
, 86: [[65, 48, 29], [40, 36, 3], [] 'โรงพยาบาลนครปฐม']\
, 87: [[11, 9, 7], [6, 5, 0], [] 'โรงพยาบาลชำนิ']\
, 88: [[20, 9, 14], [2, 1, 1], [] 'โรงพยาบาลแหลมฉบังอินเตอร์เนชั่นแนล']\
, 89: [[16, 15, 8], [2, 0, 0], [] 'โรงพยาบาลปทุมราชวงศา']\
, 90: [[0, 0, 0], [1, 1, 0], [] 'โรงพยาบาลบึงบูรพ์']\
, 91: [[1, 1, 0], [3, 3, 1], [] 'โรงพยาบาลตะกั่วทุ่ง']\
, 92: [[6, 3, 2], [3, 3, 0], [] 'โรงพยาบาลเมืองยาง']\
, 93: [[60, 56, 15], [34, 30, 0], [] 'โรงพยาบาลเมืองฉะเชิงเทรา']\
, 94: [[34, 26, 17], [15, 8, 1], [] 'โรงพยาบาลแม่จัน']\
, 95: [[18, 14, 13], [10, 8, 3], [] 'โรงพยาบาลราษีไศล']\
, 96: [[23, 20, 4], [13, 13, 0], [] 'โรงพยาบาลสุไหงโก-ลก']\
, 97: [[14, 11, 1], [7, 5, 0], [] 'โรงพยาบาลบางระกำ']\
, 98: [[41, 33, 26], [19, 14, 3], [] 'โรงพยาบาลพุทธชินราช']\
, 99: [[13, 10, 7], [10, 6, 1], [] 'โรงพยาบาลชุมพวง']\
, 100: [[21, 19, 13], [12, 5, 1], [] 'โรงพยาบาลหนองบุนนาก']\
, 101: [[14, 14, 6], [11, 11, 1], [] 'โรงพยาบาลทุ่งเสลี่ยม']\
, 102: [[13, 7, 9], [4, 2, 0], [] 'โรงพยาบาลนาเชือก']\
, 103: [[19, 16, 12], [10, 8, 1], [] 'โรงพยาบาลรัตนบุรี']\
, 104: [[43, 36, 10], [33, 29, 2], [] 'โรงพยาบาลบ้านโป่ง']\
, 105: [[9, 9, 4], [5, 4, 3], [] 'โรงพยาบาลแม่ลาว']\
, 106: [[20, 18, 8], [9, 8, 4], [] 'โรงพยาบาลแม่สรวย']\
, 107: [[7, 6, 5], [9, 6, 1], [] 'โรงพยาบาลจุฬาภรณ์']\
, 108: [[31, 20, 20], [17, 7, 0], [] 'โรงพยาบาลขุนหาญ']\
, 109: [[10, 7, 2], [14, 14, 1], [] 'โรงพยาบาลลานสัก']\
, 110: [[21, 19, 12], [8, 8, 0], [] 'โรงพยาบาลตาพระยา']\
, 111: [[11, 9, 4], [3, 2, 2], [] 'โรงพยาบาลบางกรวย']\
, 112: [[1, 1, 1], [1, 1, 0], [] 'โรงพยาบาลท่าลี่']\
, 113: [[6, 6, 5], [6, 5, 0], [] 'โรงพยาบาลแม่ทา']\
, 114: [[8, 7, 5], [6, 2, 0], [] 'โรงพยาบาลภูเรือ']\
, 115: [[54, 46, 26], [31, 20, 2], [] 'โรงพยาบาลสุรินทร์']\
, 116: [[38, 25, 21], [21, 16, 4], [] 'โรงพยาบาลมาบตาพุด']\
, 117: [[48, 32, 9], [28, 14, 1], [] 'โรงพยาบาลสงขลา']\
, 118: [[7, 5, 3], [2, 2, 0], [] 'โรงพยาบาลสามโก้']\
, 119: [[14, 12, 11], [7, 7, 3], [] 'โรงพยาบาลวานรนิวาส']\
, 120: [[2, 2, 0], [1, 1, 0], [] 'โรงพยาบาลบันนังสตา']\
, 121: [[83, 52, 28], [36, 30, 3], [] 'โรงพยาบาลระยอง']\
, 122: [[14, 11, 5], [5, 4, 0], [] 'โรงพยาบาลแสวงหา']\
, 123: [[38, 30, 16], [20, 16, 4], [] 'โรงพยาบาลประโคนชัย']\
, 124: [[34, 30, 10], [11, 9, 2], [] 'โรงพยาบาลจอมบึง']\
, 125: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลนครคริสเตียน']\
, 126: [[33, 30, 6], [11, 9, 0], [] 'โรงพยาบาลยะลา']\
, 127: [[2, 0, 1], [1, 1, 0], [] 'โรงพยาบาลเมืองปาน']\
, 128: [[14, 12, 7], [3, 3, 0], [] 'โรงพยาบาลปากพนัง']\
, 129: [[13, 11, 8], [1, 1, 0], [] 'โรงพยาบาลโนนคูณ']\
, 130: [[5, 4, 2], [4, 1, 1], [] 'โรงพยาบาลเกาะกูด']\
, 131: [[21, 19, 9], [10, 8, 1], [] 'โรงพยาบาลนครพนม']\
, 132: [[19, 16, 7], [10, 9, 0], [] 'โรงพยาบาลสะเดา']\
, 133: [[24, 13, 12], [25, 19, 2], [] 'โรงพยาบาลวัฒนานคร']\
, 134: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลเซนหลุยส์']\
, 135: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลค่ายสุรนารี']\
, 136: [[37, 24, 19], [10, 6, 1], [] 'โรงพยาบาลพนัสนิคม']\
, 137: [[19, 13, 10], [12, 6, 0], [] 'โรงพยาบาลสตูล']\
, 138: [[12, 6, 6], [6, 4, 1], [] 'โรงพยาบาลโพนสวรรค์']\
, 139: [[59, 43, 24], [50, 37, 5], [] 'โรงพยาบาลชลบุรี']\
, 140: [[12, 10, 4], [4, 2, 0], [] 'โรงพยาบาลบางไทร']\
, 141: [[11, 11, 7], [3, 3, 1], [] 'โรงพยาบาลแคนดง']\
, 142: [[18, 11, 3], [11, 8, 0], [] 'โรงพยาบาลราชธานี']\
, 143: [[22, 13, 11], [14, 10, 3], [] 'โรงพยาบาลหนองพอก']\
, 144: [[3, 2, 2], [2, 2, 1], [] 'โรงพยาบาลบ้านโคก']\
, 145: [[55, 41, 29], [40, 24, 5], [] 'โรงพยาบาลมหาราชนครเชียงใหม่']\
, 146: [[11, 7, 3], [7, 5, 1], [] 'โรงพยาบาลกรุงเทพคริสเตียนนครปฐม']\
, 147: [[28, 23, 13], [6, 6, 0], [] 'โรงพยาบาลบึงกาฬ']\
, 148: [[0, 0, 0], [0, 0, 0], [] 'โรงพยาบาลป.แพทย์']\
, 149: [[66, 51, 21], [32, 26, 0], [] 'โรงพยาบาลเจ้าพระยายมราช']\
, 150: [[25, 15, 12], [20, 3, 1], [] 'โรงพยาบาลกรุงเทพพัทยา']\
# , 151: [[14, 12, 2], [9, 6, 0], 'โรงพยาบาลพุนพิน']\
# , 152: [[29, 18, 15], [16, 12, 0], 'โรงพยาบาลโชคชัย']\
# , 153: [[0, 0, 0], [0, 0, 0], 'โรงพยาบาลราษฏร์ยินดี']\
# , 154: [[8, 6, 2], [7, 5, 2], 'โรงพยาบาลหนองใหญ่']\
# , 155: [[12, 10, 2], [15, 11, 1], 'โรงพยาบาลควนขนุน']\
# , 156: [[16, 12, 1], [3, 2, 0], 'โรงพยาบาลสามร้อยยอด']\
# , 157: [[18, 13, 9], [12, 10, 0], 'โรงพยาบาลคง']\
# , 158: [[21, 19, 8], [9, 9, 0], 'โรงพยาบาลบ้านกรวด']\
# , 159: [[19, 18, 13], [4, 3, 0], 'โรงพยาบาลบ้านลาด']\
# , 160: [[8, 7, 4], [1, 1, 0], 'โรงพยาบาลเสริมงาม']\
# , 161: [[15, 14, 1], [2, 1, 0], 'โรงพยาบาลกรุงเทพ-ตราด']\
# , 162: [[9, 5, 4], [1, 1, 0], 'โรงพยาบาลรัตนวาปี']\
# , 163: [[13, 13, 7], [4, 4, 0], 'โรงพยาบาลคูเมือง']\
# , 164: [[1, 1, 0], [0, 0, 0], 'โรงพยาบาลชลลดา']\
# , 165: [[12, 9, 4], [3, 2, 0], 'โรงพยาบาลโคกโพธิ์']\
# , 166: [[4, 2, 3], [3, 3, 0], 'โรงพยาบาลดอยหล่อ']\
# , 167: [[7, 5, 3], [1, 1, 0], 'โรงพยาบาลปะเหลียน']\
# , 168: [[4, 2, 0], [8, 6, 1], 'โรงพยาบาลนวนคร']\
# , 169: [[4, 2, 2], [3, 2, 0], 'โรงพยาบาลหนองขาหย่าง']\
# , 170: [[6, 5, 1], [2, 2, 0], 'โรงพยาบาลบ้านโพธิ์']\
# , 171: [[16, 14, 11], [3, 3, 1], 'โรงพยาบาลวังหิน']\
# , 172: [[12, 11, 6], [6, 6, 0], 'โรงพยาบาลหันคา']\
# , 173: [[9, 4, 7], [1, 1, 0], 'โรงพยาบาลพนม']\
# , 174: [[4, 4, 2], [2, 2, 0], 'โรงพยาบาลสมเด็จพระสังฆราช(นครหลวง)']\
# , 175: [[1, 0, 0], [0, 0, 0], 'โรงพยาบาลกรุงสยามเนต์คาร์ลอส']\
# , 176: [[1, 1, 0], [1, 1, 0], 'โรงพยาบาลภัทร-ธนบุรี']\
# , 177: [[27, 20, 15], [14, 8, 0], 'โรงพยาบาลสันทราย']\
# , 178: [[1, 1, 0], [3, 0, 0], 'โรงพยาบาลสำโรง']\
# , 179: [[27, 24, 17], [14, 13, 4], 'โรงพยาบาลพาน']\
# , 180: [[29, 23, 17], [13, 12, 2], 'โรงพยาบาลโกสุมพิสัย']\
# , 181: [[38, 32, 20], [15, 15, 0], 'โรงพยาบาลโพนทอง']\
# , 182: [[10, 8, 4], [6, 5, 1], 'โรงพยาบาลเชียรใหญ่']\
# , 183: [[7, 5, 3], [0, 0, 0], 'โรงพยาบาลอัมพวา']\
# , 184: [[24, 14, 10], [6, 4, 0], 'โรงพยาบาลพุทธมลฑล']\
# , 185: [[4, 4, 3], [4, 4, 0], 'โรงพยาบาลบางแก้ว']\
# , 186: [[30, 24, 17], [20, 15, 0], 'โรงพยาบาลดอยสะเก็ด']\
# , 187: [[7, 6, 0], [1, 1, 0], 'โรงพยาบาลสังขละบุรี']\
# , 188: [[5, 2, 2], [5, 3, 0], 'โรงพยาบาลค่ายสุรสีห์']\
# , 189: [[18, 15, 4], [9, 8, 0], 'โรงพยาบาลบ้านดอนอินเตอร์']\
# , 190: [[11, 9, 7], [6, 6, 0], 'โรงพยาบาลกงไกรลาศ']\
# , 191: [[40, 26, 19], [21, 16, 1], 'โรงพยาบาลแก่งคอย']\
# , 192: [[17, 11, 6], [10, 6, 1], 'โรงพยาบาลเชียงใหม่ราม2']\
# , 193: [[60, 55, 20], [34, 31, 6], 'โรงพยาบาลอุดรธานี']\
# , 194: [[10, 9, 2], [12, 11, 0], 'โรงพยาบาลไชยา']\
# , 195: [[13, 12, 6], [6, 3, 1], 'โรงพยาบาลด่านซ้าย']\
# , 196: [[15, 12, 5], [10, 1, 0], 'โรงพยาบาลลาดบัวหลวง']\
# , 197: [[7, 6, 2], [4, 4, 0], 'โรงพยาบาลหนองโดน']\
# , 198: [[2, 1, 0], [1, 1, 0], 'โรงพยาบาลพระวอ']\
# , 199: [[0, 0, 0], [0, 0, 0], 'โรงพยาบาลวัฒนแพทย์']\
# , 200: [[12, 9, 5], [14, 8, 0], 'โรงพยาบาลมหาลัยนเรศวร']\
# , 201: [[8, 4, 2], [3, 1, 0], 'โรงพยาบาลมงกุฎระยอง']\
# , 202: [[17, 16, 14], [4, 3, 1], 'โรงพยาบาลน้ำโสม']\
# , 203: [[17, 13, 9], [7, 5, 2], 'โรงพยาบาลแจ้ห่ม']\
# , 204: [[9, 8, 7], [3, 1, 0], 'โรงพยาบาลเขาฉกรรจ์']\
# , 205: [[21, 16, 13], [10, 7, 0], 'โรงพยาบาลสำโรงทาบ']\
# , 206: [[15, 12, 11], [6, 4, 1], 'โรงพยาบาลสันกำแพง']\
# , 207: [[36, 21, 5], [29, 11, 3], 'โรงพยาบาลตากสินจันทบุรี']\
# , 208: [[1, 1, 1], [0, 0, 0], 'โรงพยาบาลบ้านแพรก']\
# , 209: [[2, 2, 0], [1, 1, 0], 'โรงพยาบาลพลับพลาชัย']\
# , 210: [[52, 47, 29], [27, 23, 2], 'โรงพยาบาลพะเยา']\
# , 211: [[12, 7, 4], [6, 5, 0], 'โรงพยาบาลภาชี']\
# , 212: [[15, 14, 5], [16, 13, 0], 'โรงพยาบาลสรรคบุรี']\
# , 213: [[16, 14, 10], [7, 7, 1], 'โรงพยาบาลศรีวิไล']\
# , 214: [[24, 21, 9], [8, 5, 0], 'โรงพยาบาลสมุยอินเตอร์เนชั่นแนล']\
# , 215: [[10, 10, 1], [5, 5, 0], 'โรงพยาบาลพิปูน']\
# , 216: [[5, 5, 0], [1, 1, 0], 'โรงพยาบาลหัวตะพาน']\
# , 217: [[16, 10, 11], [11, 6, 0], 'โรงพยาบาลขุขันธ์']\
# , 218: [[27, 22, 19], [8, 7, 1], 'โรงพยาบาลวังสะพุง']\
# , 219: [[28, 24, 11], [13, 8, 0], 'โรงพยาบาลสวนผึ้ง']\
# , 220: [[19, 17, 12], [8, 5, 0], 'โรงพยาบาลหนองหญ้าไซ']\
# , 221: [[11, 10, 0], [6, 6, 0], 'โรงพยาบาลทุ่งหว้า']\
# , 222: [[19, 16, 10], [6, 6, 2], 'โรงพยาบาลเขาวง']\
# , 223: [[3, 0, 0], [1, 0, 0], 'โรงพยาบาลเมืองสรวง']\
# , 224: [[27, 21, 10], [9, 8, 1], 'โรงพยาบาลปักธงชัย']\
# , 225: [[22, 21, 8], [21, 20, 1], 'โรงพยาบาลย่านตาขาว']\
# , 226: [[12, 9, 7], [7, 5, 0], 'โรงพยาบาลค่ายประจักษ์ศิลปาคม']\
# , 227: [[5, 5, 2], [3, 3, 0], 'โรงพยาบาลศุภมิตร']\
# , 228: [[28, 18, 11], [13, 8, 1], 'โรงพยาบาลปลวกแดง']\
# , 229: [[18, 16, 13], [10, 9, 0], 'โรงพยาบาลนาแก']\
# , 230: [[11, 11, 6], [4, 4, 0], 'โรงพยาบาลนาดูน']\
# , 231: [[41, 35, 15], [40, 29, 2], 'โรงพยาบาลอุตรดิตถ์']\
# , 232: [[120, 83, 50], [87, 63, 9], 'โรงพยาบาลมหาราชนครราชสีมา']\
# , 233: [[2, 2, 1], [3, 2, 1], 'โรงพยาบาลปิยะรักษ์']\
# , 234: [[12, 10, 6], [16, 16, 4], 'โรงพยาบาลเนินมะปราง']\
# , 235: [[21, 11, 11], [11, 10, 3], 'โรงพยาบาลบ้านค่าย']\
# , 236: [[10, 8, 4], [5, 3, 0], 'โรงพยาบาลมหาราช']\
# , 237: [[8, 8, 2], [7, 6, 0], 'โรงพยาบาลนาบอน']\
# , 238: [[11, 10, 4], [3, 3, 0], 'โรงพยาบาลวังวิเศษ']\
# , 239: [[11, 10, 6], [2, 2, 0], 'โรงพยาบาลเกษตรสมบูรณ์']\
# , 240: [[18, 15, 9], [9, 5, 3], 'โรงพยาบาลชนแดน']\
# , 241: [[39, 35, 18], [19, 14, 1], 'โรงพยาบาลด่านขุนทด']\
# , 242: [[2, 2, 2], [0, 0, 0], 'โรงพยาบาลยางชุมน้อย']\
# , 243: [[12, 12, 8], [17, 16, 3], 'โรงพยาบาลตาคลี']\
# , 244: [[20, 20, 11], [13, 13, 0], 'โรงพยาบาลห้วยยอด']\
# , 245: [[15, 9, 6], [8, 7, 1], 'โรงพยาบาลพยุหะคีรี']\
# , 246: [[17, 15, 9], [7, 6, 0], 'โรงพยาบาลบางมูลนาก']\
# , 247: [[13, 10, 7], [8, 7, 0], 'โรงพยาบาลทุ่งตะโก']\
# , 248: [[13, 11, 3], [6, 3, 0], 'โรงพยาบาลบางน้ำเปรี้ยว']\
# , 249: [[12, 11, 2], [2, 2, 0], 'โรงพยาบาลลำทับ']\
# , 250: [[6, 6, 2], [1, 1, 0], 'โรงพยาบาลปากเกร็ด']\
# , 251: [[25, 17, 11], [14, 12, 0], 'โรงพยาบาลอุทัยธานี']\
# , 252: [[24, 16, 14], [17, 12, 1], 'โรงพยาบาลอ่างทอง']\
# , 253: [[7, 7, 3], [6, 6, 2], 'โรงพยาบาลพระยืน']\
# , 254: [[23, 15, 8], [5, 4, 0], 'โรงพยาบาลกุมภวาปี']\
# , 255: [[3, 3, 0], [3, 3, 0], 'โรงพยาบาลควนกาหลง']\
# , 256: [[2, 2, 0], [2, 2, 0], 'โรงพยาบาลสะบ้าย้อย']\
# , 257: [[54, 35, 15], [38, 25, 1], 'โรงพยาบาลถลาง']\
# , 258: [[11, 8, 8], [1, 0, 0], 'โรงพยาบาลสันติสุข']\
# , 259: [[10, 9, 5], [2, 2, 1], 'โรงพยาบาลหนองบัวแดง']\
# , 260: [[11, 10, 7], [6, 6, 2], 'โรงพยาบาลขลุง']\
# , 261: [[42, 36, 16], [20, 14, 3], 'โรงพยาบาลชุมพร']\
# , 262: [[30, 18, 15], [10, 5, 1], 'โรงพยาบาลหนองแค']\
# , 263: [[6, 6, 1], [6, 5, 0], 'โรงพยาบาลยะหริ่ง']\
# , 264: [[7, 6, 2], [8, 6, 0], 'โรงพยาบาลไชยปราการ']\
# , 265: [[1, 0, 0], [1, 1, 0], 'โรงพยาบาลเมืองเพชร']\
# , 266: [[14, 11, 9], [9, 6, 1], 'โรงพยาบาลบ้านไผ่']\
# , 267: [[10, 8, 4], [12, 11, 0], 'โรงพยาบาลซานเปาโลหัวหิน']\
# , 268: [[7, 6, 5], [3, 3, 2], 'โรงพยาบาลอุ้มผาง']\
# , 269: [[23, 21, 13], [17, 13, 0], 'โรงพยาบาลวิเศษชัยชาญ']\
# , 270: [[22, 21, 1], [13, 12, 0], 'โรงพยาบาลนราธิวาสราชนครินทร์']\
# , 271: [[4, 4, 1], [3, 3, 0], 'โรงพยาบาลพระสมุทรเจดีย์']\
# , 272: [[5, 5, 1], [2, 2, 1], 'โรงพยาบาลควนโดน']\
# , 273: [[18, 16, 10], [9, 7, 1], 'โรงพยาบาลห้วยเม็ก']\
# , 274: [[41, 35, 15], [18, 15, 2], 'โรงพยาบาลชะอำ']\
# , 275: [[56, 40, 5], [24, 16, 0], 'โรงพยาบาลกำแพงเพชร']\
# , 276: [[9, 5, 0], [3, 0, 0], 'โรงพยาบาลกรุงเทพหาดใหญ่']\
# , 277: [[34, 23, 9], [5, 4, 0], 'โรงพยาบาลอุทุมพรพิสัย']\
# , 278: [[6, 3, 2], [5, 3, 0], 'โรงพยาบาลด่านมะขามเตี้ย']\
# , 279: [[8, 4, 4], [2, 1, 0], 'โรงพยาบาลบางนา3']\
# , 280: [[11, 10, 8], [2, 2, 0], 'โรงพยาบาลสทิงพระ']\
# , 281: [[1, 0, 1], [3, 1, 2], 'โรงพยาบาลคอนสวรรค์']\
# , 282: [[13, 12, 10], [3, 3, 0], 'โรงพยาบาลเชียงยืน']\
# , 283: [[10, 7, 0], [2, 1, 0], 'โรงพยาบาลกรุงเทพพระประแดง']\
# , 284: [[13, 6, 3], [7, 4, 0], 'โรงพยาบาลราชสีมาธนบุรี']\
# , 285: [[8, 5, 1], [10, 8, 1], 'โรงพยาบาลเกาะลันตา']\
# , 286: [[19, 17, 13], [4, 3, 2], 'โรงพยาบาลอากาศอำนวย']\
# , 287: [[15, 9, 5], [5, 3, 0], 'โรงพยาบาลบางปะหัน']\
# , 288: [[13, 10, 7], [9, 5, 0], 'โรงพยาบาลสูงเนิน']\
# , 289: [[0, 0, 0], [0, 0, 0], 'โรงพยาบาลสงเสริมสุขภาพเขต']\
# , 290: [[29, 24, 14], [10, 9, 1], 'โรงพยาบาลทับสะแก']\
# , 291: [[13, 9, 4], [11, 9, 0], 'โรงพยาบาลบางบ่อ']\
# , 292: [[14, 14, 11], [6, 6, 1], 'โรงพยาบาลภูเขียว']\
# , 293: [[8, 5, 5], [4, 2, 0], 'โรงพยาบาลเดชอุดม']\
# , 294: [[2, 2, 0], [3, 3, 1], 'โรงพยาบาลบ้านแท่น']\
# , 295: [[5, 3, 2], [0, 0, 0], 'โรงพยาบาลดอนตาล']\
# , 296: [[12, 10, 4], [1, 0, 0], 'โรงพยาบาลบางบาล']\
# , 297: [[9, 6, 5], [1, 1, 0], 'โรงพยาบาลพนา']\
# , 298: [[7, 7, 4], [1, 1, 0], 'โรงพยาบาลพระอาจารย์แบน']\
# , 299: [[16, 15, 12], [3, 3, 1], 'โรงพยาบาลป่าแดด']\
# , 300: [[30, 21, 9], [9, 8, 4], 'โรงพยาบาลชุมแสง']\
# , 301: [[16, 15, 6], [6, 4, 1], 'โรงพยาบาลบ้านตาก']\
# , 302: [[3, 0, 1], [2, 2, 0], 'โรงพยาบาลสากเหล็ก']\
# , 303: [[2, 2, 0], [0, 0, 0], 'โรงพยาบาลกองบิน7']\
# , 304: [[16, 13, 10], [8, 5, 2], 'โรงพยาบาลเกาะพงัน']\
# , 305: [[46, 41, 27], [25, 23, 4], 'โรงพยาบาลหนองคาย']\
# , 306: [[5, 4, 0], [2, 0, 0], 'โรงพยาบาลสมิติเวชศรีราชา']\
# , 307: [[8, 8, 6], [7, 7, 0], 'โรงพยาบาลโนนแดง']\
# , 308: [[19, 19, 11], [15, 15, 4], 'โรงพยาบาลเทิง']\
# , 309: [[1, 1, 1], [0, 0, 0], 'โรงพยาบาลค่ายเทพสตรีศรีสุนทร']\
# , 310: [[5, 4, 2], [1, 1, 0], 'โรงพยาบาลถ้ำพรรณรา']\
# , 311: [[12, 10, 4], [9, 9, 3], 'โรงพยาบาลโพธิ์ประทับช้าง']\
# , 312: [[10, 5, 5], [0, 0, 0], 'โรงพยาบาลเจริญศิลป์']\
# , 313: [[10, 9, 4], [1, 1, 0], 'โรงพยาบาลบึงสามัคคี']\
# , 314: [[14, 11, 8], [2, 2, 0], 'โรงพยาบาลเพ็ญ']\
# , 315: [[3, 2, 2], [1, 1, 0], 'โรงพยาบาลเอกชนบุรีรัมย์']\
# , 316: [[17, 13, 8], [10, 7, 0], 'โรงพยาบาลแม่สะเรียง']\
# , 317: [[10, 9, 7], [5, 5, 0], 'โรงพยาบาลมาบอำมฤต']\
# , 318: [[2, 2, 0], [1, 1, 0], 'โรงพยาบาลดอนพุด']\
# , 319: [[4, 3, 3], [0, 0, 0], 'โรงพยาบาลเหล่าเสือโก้ก']\
# , 320: [[24, 23, 13], [7, 6, 2], 'โรงพยาบาลไชยวาน']\
# , 321: [[31, 22, 15], [6, 5, 0], 'โรงพยาบาลครบุรี']\
# , 322: [[9, 8, 6], [1, 1, 0], 'โรงพยาบาลเรณูนคร']\
# , 323: [[11, 10, 5], [5, 4, 0], 'โรงพยาบาลตะโหมด']\
# , 324: [[3, 0, 0], [0, 0, 0], 'โรงพยาบาลนาจะหลวย']\
# , 325: [[3, 3, 2], [2, 2, 0], 'โรงพยาบาลพะโต๊ะ']\
# , 326: [[32, 27, 7], [10, 9, 0], 'โรงพยาบาลสมเด็จพระสังฆราชองค์ที่17']\
# , 327: [[20, 17, 10], [5, 4, 0], 'โรงพยาบาลขาณุวรลักษบุรี']\
# , 328: [[94, 59, 29], [61, 45, 12], 'โรงพยาบาลป่าตอง']\
# , 329: [[13, 12, 2], [10, 10, 0], 'โรงพยาบาลชะอวด']\
# , 330: [[30, 21, 15], [18, 15, 1], 'โรงพยาบาลรัตภูมิ']\
# , 331: [[3, 1, 2], [1, 1, 0], 'โรงพยาบาลกระแสสินธุ์']\
# , 332: [[4, 3, 3], [3, 3, 0], 'โรงพยาบาลหนองฮี']\
# , 333: [[71, 64, 33], [47, 37, 8], 'โรงพยาบาลร้อยเอ็ด']\
# , 334: [[5, 5, 3], [8, 8, 0], 'โรงพยาบาลปาดังเบซาร์']\
# , 335: [[3, 2, 3], [1, 1, 1], 'โรงพยาบาลหนองม่วงไข่']\
# , 336: [[20, 7, 4], [17, 10, 3], 'โรงพยาบาลกรุงเทพสมุย']\
# , 337: [[12, 11, 5], [2, 2, 0], 'โรงพยาบาลมะขาม']\
# , 338: [[23, 19, 13], [15, 13, 2], 'โรงพยาบาลยโสธร']\
# , 339: [[25, 23, 9], [12, 11, 3], 'โรงพยาบาลไพศาลี']\
# , 340: [[2, 2, 1], [1, 1, 1], 'โรงพยาบาลลาดหลุมแก้ว']\
# , 341: [[27, 21, 14], [11, 7, 0], 'โรงพยาบาลเกาะคา']\
# , 342: [[39, 34, 19], [14, 12, 2], 'โรงพยาบาลวิเชียรบุรี']\
# , 343: [[39, 34, 28], [7, 5, 1], 'โรงพยาบาลท่าตูม']\
# , 344: [[1, 1, 0], [0, 0, 0], 'โรงพยาบาลทุ่งยางแดง']\
# , 345: [[6, 6, 3], [1, 1, 0], 'โรงพยาบาลทุ่งช้าง']\
# , 346: [[8, 7, 6], [4, 2, 0], 'โรงพยาบาลภูหลวง']\
# , 347: [[4, 4, 3], [3, 3, 0], 'โรงพยาบาลห้วยกระเจา']\
# , 348: [[7, 7, 4], [2, 2, 0], 'โรงพยาบาลคีรีรัฐนิคม']\
# , 349: [[18, 15, 11], [5, 5, 0], 'โรงพยาบาลคำเขื่อนแก้ว']\
# , 350: [[8, 8, 1], [3, 3, 0], 'โรงพยาบาลท่าฉาง']\
# , 351: [[2, 1, 0], [2, 1, 0], 'โรงพยาบาลปากพลี']\
# , 352: [[8, 7, 3], [3, 3, 1], 'โรงพยาบาลแหลมสิงห์']\
# , 353: [[13, 13, 3], [3, 3, 1], 'โรงพยาบาลวิภาวดี']\
# , 354: [[7, 4, 3], [4, 0, 0], 'โรงพยาบาลตรอน']\
# , 355: [[11, 10, 7], [12, 11, 2], 'โรงพยาบาลพนมไพร']\
# , 356: [[13, 11, 3], [8, 8, 1], 'โรงพยาบาลลานกระบือ']\
# , 357: [[2, 1, 1], [0, 0, 0], 'โรงพยาบาลธนบุรี-ชุมพร']\
# , 358: [[1, 1, 1], [0, 0, 0], 'โรงพยาบาลเซกา']\
# , 359: [[6, 5, 2], [3, 3, 2], 'โรงพยาบาลทุ่งฝน']\
# , 360: [[20, 17, 15], [6, 5, 1], 'โรงพยาบาลคลองลาน']\
# , 361: [[17, 4, 2], [7, 1, 0], 'โรงพยาบาลกรุงเทพภูเก็ต']\
# , 362: [[32, 28, 8], [24, 13, 5], 'โรงพยาบาลสุราษฎร์ธานี']\
# , 363: [[4, 4, 0], [0, 0, 0], 'โรงพยาบาลค่ายศรีพัชรินทร']\
# , 364: [[14, 11, 1], [15, 8, 0], 'โรงพยาบาลองค์การบริหาร่ส่วนจังหวัดภูเก็ต']\
# , 365: [[10, 7, 6], [8, 8, 0], 'โรงพยาบาลศรีเชียงใหม่']\
# , 366: [[7, 6, 7], [6, 4, 0], 'โรงพยาบาลเขาสมิง']\
# , 367: [[4, 3, 2], [12, 11, 0], 'โรงพยาบาลหนองหญ้าปล้อง']\
# , 368: [[6, 3, 2], [10, 6, 1], 'โรงพยาบาลโกรกพระ']\
# , 369: [[10, 10, 4], [11, 10, 1], 'โรงพยาบาลเขาคิชฌกูฏ']\
# , 370: [[0, 0, 0], [3, 0, 0], 'โรงพยาบาลเทพากร']\
# , 371: [[37, 24, 15], [31, 21, 2], 'โรงพยาบาลมหาสารคาม']\
# , 372: [[16, 13, 8], [15, 13, 0], 'โรงพยาบาลท่าใหม่']\
# , 373: [[15, 7, 6], [7, 5, 0], 'โรงพยาบาลโพทะเล']\
# , 374: [[0, 0, 0], [0, 0, 0], 'โรงพยาบาลสมเด็จพระสังฆราชองค์ที่']\
# , 375: [[11, 8, 5], [6, 6, 0], 'โรงพยาบาลบางใหญ่']\
# , 376: [[4, 4, 3], [5, 5, 0], 'โรงพยาบาลหนองบัวระเหว']\
# , 377: [[36, 29, 20], [13, 9, 0], 'โรงพยาบาลนางรอง']\
# , 378: [[8, 4, 4], [2, 2, 0], 'โรงพยาบาลเมืองสมทรปากน้ำ']\
# , 379: [[8, 6, 4], [3, 3, 0], 'โรงพยาบาลพรหมคีรี']\
# , 380: [[14, 12, 1], [8, 7, 0], 'โรงพยาบาลกันตัง']\
# , 381: [[12, 12, 12], [11, 10, 1], 'โรงพยาบาลปัว']\
# , 382: [[4, 2, 0], [5, 5, 0], 'โรงพยาบาลยะรัง']\
# , 383: [[17, 17, 13], [4, 4, 1], 'โรงพยาบาลหนองวัวซอ']\
# , 384: [[5, 4, 5], [2, 2, 0], 'โรงพยาบาลวาริชภูมิ']\
# , 385: [[3, 2, 0], [2, 2, 0], 'โรงพยาบาลเพชรรัตน์']\
# , 386: [[3, 3, 3], [1, 1, 0], 'โรงพยาบาลทุ่งเขาหลวง']\
# , 387: [[26, 15, 10], [8, 7, 1], 'โรงพยาบาลอุบลรัตน์']\
# , 388: [[16, 13, 6], [10, 9, 0], 'โรงพยาบาลบางสะพานน้อย']\
# , 389: [[7, 5, 1], [6, 5, 0], 'โรงพยาบาลป่าติ้ว']\
# , 390: [[25, 23, 13], [8, 7, 0], 'โรงพยาบาลอาจสามารถ']\
# , 391: [[17, 13, 7], [5, 4, 0], 'โรงพยาบาลหัวไทร']\
# , 392: [[14, 10, 5], [5, 5, 3], 'โรงพยาบาลกุดจับ']\
# , 393: [[18, 17, 11], [13, 13, 1], 'โรงพยาบาลศรีสังวร']\
# , 394: [[15, 12, 9], [10, 7, 0], 'โรงพยาบาลบ้านนา']\
# , 395: [[26, 18, 12], [21, 13, 0], 'โรงพยาบาลศรีนครินทร์']\
# , 396: [[10, 8, 3], [6, 4, 1], 'โรงพยาบาลศิริเวชลำพูน']\
# , 397: [[1, 0, 0], [1, 0, 0], 'โรงพยาบาลกรุงเทพขอนแก่น']\
# , 398: [[15, 12, 10], [4, 4, 0], 'โรงพยาบาลแปลงยาว']\
# , 399: [[11, 8, 4], [3, 2, 0], 'โรงพยาบาลจัตุรัส']\
# , 400: [[16, 16, 3], [12, 12, 1], 'โรงพยาบาลเบตง']}

def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_58():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_58.html')
