"""ข้อมูลปีพุทธกาล 2555"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1 : [[10, 6, 2], [5, 4, 0], [18.78845, 99.02664], "โรงพยาบาลกรุงเทพ"]\
            , 2 : [[9, 2, 2], [1, 0, 0], [13.72831, 100.53215], "โรงพยาบาลกรุงเทพคริสเตียน"]\
            , 3 : [[12, 4, 1], [8, 5, 2], [13.71075, 100.39911], "โรงพยาบาลเกษมราษฏร์บางเเค"]\
            , 4 : [[65, 51, 24], [30, 25, 11], [13.73171, 100.53647], "โรงพยาบาลจุฬาลงกรณ์"]\
            , 5 : [[15, 5, 1], [10, 6, 8], [13.69436, 100.49473], "โรงพยาบาลเจริญกรุงประชารักษ์"]\
            , 6 : [[60, 56, 25], [43, 41, 4], [13.7311, 100.508], "โรงพยาบาลตากสิน"]\
            , 7 : [[19, 13, 12], [14, 10, 1], [13.74305, 100.53837], "โรงพยาบาลตำรวจ"]\
            , 8 : [[], [], [13.66053, 100.43457], "โรงพยาบาลนครธน"]\
            , 9 : [[], [], [13.8169, 100.688], "โรงพยาบาลนพรัตนราชธานี"]\
            , 10 : [[], [], [13.8116, 100.7216], "โรงพยาบาลนวมินทร์"]\
            , 11 : [[], [], [13.7254, 100.4651], "โรงพยาบาลบางไผ่"]\
            , 12 : [[], [], [13.8072, 100.5232], "โรงพยาบาลบางโพ"]\
            , 13 : [[], [], [13.65167, 100.42214], "โรงพยาบาลพระราม 2"]\
            , 14 : [[], [], [13.7428, 100.5945], "โรงพยาบาลเพชรเวช"]\
            , 15 : [[], [], [13.7579, 100.5187], "โรงพยาบาลมิชชั่น"]\
            , 16 : [[], [], [13.7636, 100.53633], "โรงพยาบาลราชวิถี"]\
            , 17 : [[], [], [13.77811, 100.62432], "โรงพยาบาลลาดพร้าว"]\
            , 18 : [[], [], [13.78325, 100.53402], "โรงพยาบาลวิชัยยุทธ"]\
            , 19 : [[6, 4, 2], [6, 4, 0], [13.84582, 100.56227], "โรงพยาบาลวิภาวดี"]\
            , 20 : [[], [], [13.77176, 100.63703], "โรงพยาบาลเวชธานี"]\
            , 21 : [[], [], [13.7079, 100.3608], "โรงพยาบาลศรีวิชัย 2"]\
            , 22 : [[], [], [13.8255, 100.6575], "โรงพยาบาลศรีสยาม"]\
            , 23 : [[], [], [13.8562, 100.8589], "โรงพยาบาลหนองจอก"]\
            , 24 : [[], [], [13.6563, 100.3453], "โรงพยาบาลหลวงพ่อทวีศักดิ์"]\
            , 25 : [[], [], [13.7506, 100.5156], "โรงพยาบาลหัวเฉียว"]\
            , 26 : [[10, 6, 2], [5, 4, 0], [13.60832, 100.55148], "โรงพยาบาลกรุงเทพพระประแดง"]\
            , 27 : [[9, 8, 1], [4, 3, 0], [13.6098, 100.54], "โรงพยาบาลบางจาก"]\
            , 28 : [[18, 13, 5], [4, 2, 0], [13.5695, 100.8362], "โรงพยาบาลบางบ่อ"]\
            , 29 : [[13, 9, 2], [3, 1, 0], [13.6034, 100.7062], "โรงพยาบาลบางพลี"]\
            , 30 : [[14, 9, 1], [6, 5, 0], [13.5844, 100.597], "โรงพยาบาลสมุทรปราการ"]\
            , 31 : [[12, 3, 2], [4, 0, 0], [13.91296, 100.50925], "โรงพยาบาลกรุงไทย"]\
            , 32 : [[19, 13, 12], [14, 10, 1], [13.9822, 100.3254], "โรงพยาบาลไทรน้อย"]\
            , 33 : [[17, 7, 1], [4, 0, 0], [13.86427, 100.4984], "นนทเวช สหคลินิก"]\
            , 34 : [[11, 5, 3], [6, 3, 0], [13.8045, 100.4719], "โรงพยาบาลบางกรวย"]\
            , 35 : [[19, 11, 8], [4, 4, 0], [13.9186, 100.4226], "โรงพยาบาลบางบัวทอง"]\
            , 36 : [[18, 12, 9], [8, 7, 0], [13.9854, 100.6128], "โรงพยาบาลประชาธิปัตย์"]\
            , 37 : [[14, 9, 5], [5, 5, 0], [13.9569, 100.8579], "โรงพยาบาลลำลูกกา"]\
            , 38 : [[24, 12, 2], [7, 1, 0], [14.2134, 100.5764], "โรงพยาบาลบางปะอิน"]\
            , 39 : [[13, 8, 2], [7, 7, 0], [14.4448, 100.7374], "โรงพยาบาลภาชี"]\
            , 40 : [[], [], [14.8556, 100.9853], "โรงพยาบาลพัฒนานิคม"]\
            , 41 : [[], [], [14.8049, 100.6526], "โรงพยาบาลลพบุรี"]\
            , 42 : [[], [], [14.9221, 100.2747], "โรงพยาบาลบางระจัน"]\
            , 43 : [[], [], [14.89682, 100.39753], "โรงพยาบาลสิงห์บุรี"]\
            , 44 : [[], [], [15.19135, 100.12742], "โรงพยาบาลชัยนาท"]\
            , 45 : [[], [], [14.5337, 100.9147], "โรงพยาบาลสระบุรี"]\
            , 46 : [[], [], [14.5339, 100.9146], "โรงพยาบาลหนองแค"]\
            , 47 : [[], [], [13.35193, 100.98208], "โรงพยาบาลชลบุรี"]\
            , 48 : [[], [], [13.35193, 100.98208], "โรงพยาบาลบางละมุง"]\
            , 49 : [[], [], [13.45993, 101.17273], "โรงพยาบาลพนัสนิคม"]\
            , 50 : [[], [], [13.4693, 101.0987], "โรงพยาบาลพานทอง"]\
            , 51 : [[], [], [12.68226, 101.27624], "โรงพยาบาลระยอง"]\
            , 52 : [[], [], [12.4613, 102.2258], "โรงพยาบาลขลุง"]\
            , 53 : [[], [], [12.9048, 102.2632], "โรงพยาบาลโป่งน้ำร้อน"]\
            , 54 : [[], [], [13.1325, 102.2051], "โรงพยาบาลสอยดาว"]\
            , 55 : [[], [], [12.2482, 102.5122], "โรงพยาบาลตราด"]\
            , 56 : [[], [], [13.3845, 101.6947], "โรงพยาบาลท่าตะเกียบ"]\
            , 57 : [[], [], [13.7475, 101.3623], "โรงพยาบาลพนมสารคาม"]\
            , 58 : [[], [], [13.6465, 101.4412], "โรงพยาบาลสนามชัยเขต"]\
            , 59 : [[], [], [14.2079, 101.2128], "โรงพยาบาลนครนายก"]\
            , 60 : [[], [], [14.1501, 101.2679], "โรงพยาบาลปากพลี"]\
            , 61 : [[], [], [13.6527, 102.0978], "โรงพยาบาลเขาฉกรรจ์"]\
            , 62 : [[], [], [14.0072, 102.8023], "โรงพยาบาลตาพระยา"]\
            , 63 : [[], [], [13.7624, 102.3265], "โรงพยาบาลวัฒนานคร"]\
            , 64 : [[], [], [14.96545, 101.9479], "โรงพยาบาลขามทะเลสอ"]\
            , 65 : [[], [], [14.5279, 102.248], "โรงพยาบาลครบุรี"]\
            , 66 : [[], [], [14.7339, 102.1574], "โรงพยาบาลโชคชัย"]\
            , 67 : [[], [], [14.7448, 102.0324], "โรงพยาบาลปักธงชัย"]\
            , 68 : [[], [], [14.4173, 101.8632], "โรงพยาบาลวังน้ำเขียว"]\
            , 69 : [[], [], [14.8724, 101.722], "โรงพยาบาลสีคิ้ว"]\
            , 70 : [[], [], [14.7396, 102.3686], "โรงพยาบาลหนองบุนนาก"]\
            , 71 : [[], [], [0.14373730718024721], "โรงพยาบาลสุรินทร์"]\
            , 72 : [[], [], [14.8658, 104.0379], "โรงพยาบาลปรางค์กู่"]\
            , 73 : [[], [], [15.1158, 104.3202], "โรงพยาบาลศรีสะเกษ"]\
            , 74 : [[], [], [15.782, 104.1611], "โรงพยาบาลยโสธร"]\
            , 75 : [[], [], [15.8637, 104.6238], "โรงพยาบาลอำนาจเจริญ"]\
            , 76 : [[], [], [16.966, 102.2816], "โรงพยาบาลศรีบุญเรือง"]\
            , 77 : [[], [], [17.1974, 102.4578], "โรงพยาบาลหนองบัวลำภู"]\
            , 78 : [[], [], [16.42851, 102.845], "โรงพยาบาลขอนแก่น"]\
            , 79 : [[], [], [16.0587, 102.73042], "โรงพยาบาลบ้านไผ่"]\
            , 80 : [[], [], [17.416, 102.7804], "โรงพยาบาลอุดรธานี"]\
            , 81 : [[], [], [17.2827, 101.7559], "โรงพยาบาลวังสะพุง"]\
            , 82 : [[], [], [17.88733, 102.75722], "โรงพยาบาลหนองคาย"]\
            , 83 : [[], [], [16.1809, 103.2986], "โรงพยาบาลมหาสารคาม"]\
            , 84 : [[], [], [16.0479, 103.6529], "โรงพยาบาลร้อยเอ็ด"]\
            , 85 : [[], [], [16.4351, 103.5052], "โรงพยาบาลกาฬสินธุ์"]\
            , 86 : [[], [], [16.7101, 103.7525], "โรงพยาบาลสมเด็จ"]\
            , 87 : [[], [], [16.99219, 104.16035], "โรงพยาบาลเต่างอย"]\
            , 88 : [[], [], [17.6235, 103.7506], "โรงพยาบาลวานรนิวาส"]\
            , 89 : [[], [], [17.554, 104.6132], "โรงพยาบาลท่าอุเทน"]\
            , 90 : [[], [], [17.4915, 104.0958], "โรงพยาบาลนาหว้า"]\
            , 91 : [[], [], [17.6278, 104.2517], "โรงพยาบาลศรีสงคราม"]\
            , 92 : [[], [], [18.40639, 98.67434], "โรงพยาบาลจอมทอง"]\
            , 93 : [[], [], [19.7055, 99.1369], "โรงพยาบาลไชยปราการ"]\
            , 94 : [[], [], [18.86869, 99.12888], "โรงพยาบาลดอยสะเก็ด"]\
            , 95 : [[], [], [19.91321, 99.2067], "โรงพยาบาลฝาง"]\
            , 96 : [[], [], [18.7892, 98.9753], "โรงพยาบาลมหาราชนครเชียงใหม่"]\
            , 97 : [[], [], [18.8127, 98.99102], "โรงพยาบาลล้านนา เชียงใหม่"]\
            , 98 : [[], [], [18.595, 98.8862], "โรงพยาบาลสันป่าตอง"]\
            , 99 : [[], [], [18.6809, 98.9185], "โรงพยาบาลหางดง"]\
            , 100 : [[], [], [18.4459, 98.8883], "โรงพยาบาลป่าซาง"]\
            , 101 : [[], [], [18.5819, 98.99451], "โรงพยาบาลลำพูน"]\
            , 102 : [[], [], [18.28654, 99.50721], "โรงพยาบาลลำปาง"]\
            , 103 : [[], [], [19.17353, 100.00667], "โรงพยาบาลดอกคำใต้"]\
            , 104 : [[], [], [19.1901, 99.8773], "โรงพยาบาลพะเยา"]\
            , 105 : [[], [], [19.9004, 99.8273], "โรงพยาบาลเชียงรายประชานุเคราะห์"]\
            , 106 : [[], [], [20.42909, 99.87866], "โรงพยาบาลแม่สาย"]\
            , 107 : [[], [], [15.70696, 100.13846], "โรงพยาบาลสวรรค์ประชารักษ์"]\
            , 108 : [[], [], [16.8729, 99.1319], "โรงพยาบาลสมเด็จพระเจ้าตากสินมหาราช"]\
            , 109 : [[], [], [17.0106, 99.7957], "โรงพยาบาลสุโขทัย"]\
            , 110 : [[], [], [8.8411, 99.3683], "โรงพยาบาลบ้านนาสาร"]\
            , 111 : [[], [], [9.1233, 99.3099], "โรงพยาบาลสุราษฎร์ธานี"]\
            , 112 : [[], [], [10.4982, 99.1864], "โรงพยาบาลชุมพร"]\
            , 113 : [[], [], [7.14118, 100.56518], "โรงพยาบาลสงขลา"]\
            , 114 : [[], [], [7.01654, 100.46756], "โรงพยาบาลหาดใหญ่"]\
            , 115 : [[], [], [6.6183, 100.0712], "โรงพยาบาลสตูล"]\
            , 116 : [[], [], [7.6143, 100.0743], "โรงพยาบาลพัทลุง"]\
            , 117 : [[], [], [6.86913, 101.24949], "['โรงพยาบาลปัตตานี']"]\
            , 118 : [[], [], [5.7733, 101.0833], "['โรงพยาบาลเบตง']"]\
            , 119 : [[], [], [6.548, 101.27684], "['โรงพยาบาลยะลา']"]\
            , 120 : [[], [], [6.2968, 101.7258], "['โรงพยาบาลระแงะ']"]z}

def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_55():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_55.html')
